rails/events/app/controllers/attendees_controller.rb

  def create
    puts "create *****************************"
    puts params[:id]
    attendee = Attendee.new(event_id:params[:event_id], user_id: current_user.id)
    if attendee.save
---
INSERT INTO "attendees" ("event_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["event_id", 6], ["user_id", 8], ["created_at", "2017-12-14 18:34:28.709879"], ["updated_at", "2017-12-14 18:34:28.709879"]]

  def destroy
    if Attendee.find(params[:id]).destroy
---
DELETE FROM "attendees" WHERE "attendees"."id" = ?  [["id", 6]]
SELECT  "attendees".* FROM "attendees" WHERE "attendees"."id" = ? LIMIT 1  [["id", 6]]