rails/events/app/controllers/comments_controller.rb

  def create
    comment = Comment.new(comment_params)
    if comment.save
---
INSERT INTO "comments" ("content", "user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)