rails/events/app/controllers/events_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."state" = ? LIMIT 1  [["state", "NM"]]
SELECT "events"."id" FROM "events"
---
  def index
    @current_user = current_user
    @local_events = Event.find_by(state:@current_user.state)
    @out_of_state_events = Event.where.not(state:@current_user.state).ids.sample(10)