rails/events/app/controllers/events_controller.rb

  def show
    @event = Event.joins(:user).find(params[:id])
    @attendees = Attendee.joins(:user).where(event_id:params[:id])
    @comments = Comment.where(event_id: params[:id])
---
SELECT  "events".* FROM "events" INNER JOIN "users" ON "users"."id" = "events"."user_id" WHERE "events"."id" = ? LIMIT 1  [["id", 3]]
SELECT "attendees".* FROM "attendees" INNER JOIN "users" ON "users"."id" = "attendees"."user_id" WHERE "attendees"."event_id" = ?  [["event_id", 6]]
SELECT "comments".* FROM "comments" WHERE "comments"."event_id" = ?  [["event_id", 4]]

  def index
    @states = @@states
    @current_user = current_user
    @local_events = Event.joins(:user).where(state:@current_user.state)
    @out_of_state_events = Event.joins(:user).where.not(state:@current_user.state)
---
SELECT "events".* FROM "events" INNER JOIN "users" ON "users"."id" = "events"."user_id" WHERE ("events"."state" != ?)  [["state", "GU"]]
SELECT "users".* FROM "users" INNER JOIN "attendees" ON "users"."id" = "attendees"."user_id" WHERE "attendees"."event_id" = ?  [["event_id", 6]]

  def create
    puts "in create"
    event_data = event_params
    event_data['user_id'] = current_user.id
    puts event_data
    event = Event.new(event_data)
    if event.save
---
INSERT INTO "events" ("name", "date", "city", "state", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    if Event.find(params[:id]).destroy
---
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 3]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 3]]