rails/events/app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "city", "state", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    puts "hi"
    user = User.new(user_params)
    if user.save && user.password_confirmation=params[:confirm_password]

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 8]]
---
  def edit
    @current_user = User.find(params[:id])

UPDATE "users" SET "first_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "Sly"], ["updated_at", "2017-12-14 00:15:51.941216"], ["id", 8]]
---
  def update
    user = current_user
    if user.update(update_params)

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", ""]]
---
  def login
    user = User.find_by(email: params[:email])