rails/events/app/views/events/index.html.erb

                        <td><%= event.city %></td>
                        <td><%= event.user.first_name%></td>
---
SELECT "users".* FROM "users" INNER JOIN "attendees" ON "users"."id" = "attendees"."user_id" WHERE "attendees"."event_id" = ?  [["event_id", 6]]

                                        <% @joined = true %>
                                        <% user.attendees.each do |attend| %>
---
SELECT "attendees".* FROM "attendees" WHERE "attendees"."event_id" = ?  [["event_id", 4]]