rails/events/app/views/events/show.html.erb

        <h3><%= @event.name %></h3>
        <p>Host: <%= @event.user.first_name%> <%= @event.user.last_name%></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 8]]